{
  "name" : "E20R Tracker",
  "slug" : "e20r-tracker",
  "download_url" : "https://eighty20results.com/protected-content/e20r-tracker/e20r-tracker-0.9.8.zip",
  "version" : "0.9.8",
  "tested": "4.2.3",
  "requires": "4.2.0",
  "author" : "Thomas Sjolshagen <thomas@eighty20results.com>",
  "author_homepage": "https://eighty20results.com/thomas-sjolshagen",
  "last_updated": "2015-07-27 22:40:00",
  "homepage": "https://eighty20results.com/e20r-tracker",
  "sections" : {
    "description" : "Plugin for managing fitness and nutrition coaching content.<br/><br/>We recommend using this plugin in conjunction with the <a href='http://paidmembershipspro.com' target='_blank'>Paid Memberships Pro</a> plugin, and the <a href='https://eighty20results.com/pmpro-sequence/' target='_blank'>PMPro Sequences</a> plugin.",
    "changelog": "<h3>0.9.8</h3><ol><li>Use the delay value for the article that is manages the postId to verify access. If the delay value is <= the the userIds current delay value, grant access.</li><li>Set the program start date to that of the user (i.e. force the startdate to be keyed off of the users membership start date).</li><li>Force use of the membership plugin's start date for the specified user.</li><li>Base access on the delay value for the specified user(s).</li><li>Handle the 'First day of the program, not allowed to proceed backwards' error message (ecode == 2)</li><li>On the first day of the program, it allowed you to attempt to navigate backwards without having any defined articles available. This caused error messages.</li><li>Return a specific error code to the AJAX caller if we're on the first day of the program for this user and they try to go backwards.</li></ol><h3>0.9.7</h3><ol><li>Add styles for legend/description on Achievements tab</li><li>Add legend/description for Achievements tab</li><li>Didn't load assignment & lesson/reminder for the 'to' day in the Dashboard day navigation.</li></ol><h3>0.9.6</h3><ol><li>Handle migration from  articles/assignments/checkins settings/postmeta to using article_ids/assignment_ids/checkin_ids</li><li>Set program id for measurement entry in progress overview 'measurement history' table</li><li>Reset postdata whenever using WP_Query(), get_posts() or get_pages()</li><li>Add private sort function (sortAssignments()): Will sort based on delay and order_num value ( delay, then order_num )</li><li>Nits for setting up arguments in loadAssignmentByMeta()</li><li>Skip entries with field_type = 0 ('Completed' button) unless searching based on field_type.</li><li>Also include article_id from database ({wp_prefix}_e20r_assignments table when loading user data for an assignment.</li><li>Fix issue where the system would always load default settings if an assignment question had been defined.</li><li>Move addPrograms() function to parent class.</li><li>Add addPrograms() function to allow adding of a single program_id to the existing settings->program_ids array.</li><li>Load from the correct select2 CDN (assume HTTPS) Reset postdata after using WP_Query() or get_posts()</li><li>Add URL to weekly_progress form to the javascript settings array.</li><li>Because we moved to using the parent::find() function we have to deal with testing whether the data returned is an array or an object before attempting to use it</li><li>Need a program id setting when configured when we list the assignments for the user</li><li>Use the e20r_progress.settings.weekly_progress constant to locate the URL for the measurement form</li><li>Fix layout/styles on measurement page(s)</li><li>Fix layout/style for photo upload buttons on measurement page.</li><li>Use page_id setting for generating link to the correct measurement form when listing the table of measurements.</li><li>Use correct URL to check-mark graphic for viewLessonComplete()</li><li>Use measurement_page_id setting for loading link to measurement form.</li><li>Use parent class find() function to load article data.</li><li>Add rudimentary client_info data listing</li><li>Load & view available client information in /wp-admin/ back end</li><li>Add support for handling redirection for logged in user when attempting to access multiple sales pages in contentFilter()</li><li>Add support for handling multiple sales pages in contentFilter()</li><li>Rename save button from 'Complete' to 'Save Answers'</li><li>Make sure the dashboard page ID has been defined.</li><li>Add redirect to dashboard if a logged in user (who's a member of the program) is attempting to access the sales page/post.</li><li>URL to client info page was incomplete</li></ol><h3>0.9.5</h3><ol><li>Handle situations where user has defined a workout with start/end day number or dates.</li><li>Include support for handling proper WP meta_query for program_id limited searches</li><li>Use $currentArticle rather than loading the same data again.</li><li>viewExerciseProgress() - Test activity list being received against empty() not is_null()</li><li>Fix issue when searching for article definitions belonging to a specific program.</li><li>Simplify findArticle() and leverage the find() function from the parent class while still ignoring 'always available' articles (Possibly not what we want!)</li><li>Simplify and use WP meta_query when searching for program specific check-in definitions</li><li>Remove debug output for loadOption() function - too noisy</li><li>Fix: Achievements statistics in progress overview.</li><li>Fix: Attempted to show excerpt when there was no action or activity defined.</li><li>For consistency use $currentArticle for accessing article settings</li><li>Fix: Achievements statistics in progress overview.</li><li>Automated metadata conversion (from serialized array to independent meta_key values) on plugin activation.</li><li>Added constant to determine whether to convert/unserialize the metadata.</li><li>Converted from serialized program id & article id metadata (programs|program_ids|article_id|other keys) to proper meta data (for those settings) that is WP query searchable.</li><li>Indicate link to assignment page when listing assignments in the progress_overview short code.</li></ol><h3>0.9.4</h3><ol><li>Use the article summary - if it exists - for the action excerpt.</li><li>Set background color to white for activity history list</li></ol><h3>0.9.3</h3><ol><li>Simplify processing of workout history for user's progress overview.</li><li>Allow metadata upgrade to proceed</li><li>White-screen of death issue (undeclared variable)</li></ol><h3>0.9.2</h3><ol><li>Fix static/non-static call warnings in e20rTracker</li><li>Removed unused global declaration</li><li>Add support for showing Activity history (i.e. the exercise rep statistics)</li><li>Ensure all assignment data gets loaded when requested.</li><li>Hide annoying alert dialog when there are no measurements to be found for the user.</li><li>Fix text for default setting (no page) in Program definition meta</li><li>Add program list to assignment definition (may hide at some point in future)</li><li>Don't limit number of records returned in loadAllSettings()</li><li>Refactor parameters</li><li>Transition to using currentClient global variable.</li><li>Save program ID(s) for each assignment used by the article.</li><li>Add update_metadata() at init for Assignments</li><li>Load all required scripts and styles to front-end.</li><li>Transition isEmpty() to the global e20rTracker class.</li><li>Use the isEmpty() function to check whether objects/arrays contain data</li><li>Only load assignment if it's defined as belonging to the program(s) (Or there are not programs defined for this assignment)</li><li>Force program_ids settings to be an array (if it's not when loaded).</li><li>Support updating assignment options (name and values) on init.</li><li>Add program list to assignment definition</li><li>Correctly process assignments array during save</li><li>Didn't always recognize if the e20rMeasurements object was empty or not.</li><li>Load Activities tab for progress_overview short code</li><li>Set user id & program info for weekly_progress short code</li><li>Fix formatting for progress_overview short code</li><li>Program-specific setting for weekly_progress page</li><li>Fix typos in changelog</li></ol><h3>0.9.1</h3><ol><li>Removed console logging of various objects</li><li>Add 'working' graphic when saving notes.</li><li>Set default measurement day to be Saturday (day #6)</li><li>Didn't attempt to list all defined mebership levels for Paid Memberships Pro</li><li>Make measurement day setting a program specific setting.</li></ol><h3>0.9</h3><ol><li>Display daily progress notes (decoupled from action check-in data)</li></ol><h3>0.8.19</h3><ol><li>Check-in action would sometimes overwrite check-in data for other days.</li><li>Set activity override if user navigates to next/previous day.</li><li>Bind to the 'Read more' activity link</li><li>Removed dummy class function</li><li>Add redirect with POST when user clicks teh 'Read more' link for a future/past activity.</li><li>Load new settings for the correct article when the user is navigating through daily_progress days</li><li>Remove commented out callback handler(s)</li><li>Remove debug for arguments in find() (log file hog!)</li><li>Handle cases where the activity short code is loaded as part of a redirect with specific activity ID & article information present. Note: Short code attributes take precedence over $_POST entries.</li><li>Only load data for specific activities if authorized to do so</li><li>Load jquery.redirect.js for daily_progress short code</li><li>Add ID to Read more link for activity & action excerpts</li><li>Add event handler for the Activity excerpt 'Read more' link</li><li>Add function to execute on click event for 'Read more' link</li><li>Add support for specifying activity to display when 'Read more' link is selected/clicked.</li></ol><h3>0.8.18</h3><ol><li>Handle situations where the delay value is 0 (i.e. the beginning of the program)</li><li>Handle (first day of program - 1 day) correctly: Nothing will be scheduled</li><li>Never prevent users from scrolling back, all the way to the beginning of the program</li></ol><h3>0.8.17</h3><ol><li>Cleaned up hasAccess() function</li><li>Admin access filter was a bit too 'aggressive' in granting access.</li><li>Handle success/failure during processing of next/previous navigation operations</li><li>Handle navigation to a different day than the current one.</li><li>Didn't consistently return an object from findArticleByDelay()</li></ol><h3>0.8.16</h3><ol><li>Updated e20r_assignments table definition</li></ol><h3>0.8.15</h3><ol><li>Lets the admin specify a '# of days since start of membership' for when the activity/workout is scheduled to become available/unavailable for the client.</li><li>Correctly return the found article ID if a single article was located.</li><li>Reformat layout of activity/workout settings in backend.</li><li>Format exercise settings window in backend</li></ol><h3>0.8.14</h3><ol><li>Handle previously given answers for a daily assignment.</li><li>Support updates to survey and yes/no fields</li><li>Didn't always reflect prior answers given. Fix: Didn't handle Yes/No answers correctly</li><li>Allow user to save whenever they update a response/answer.</li></ol><h3>0.8.12</h3><ol><li>Configure the dashboard page and progress page as part of the program definition</li><li>Set background color for the heading settings</li><li>Use $currentProgram global to set the start timestamp and page URL for the dashboard.</li><li>Load style for wp-admin when defining programs</li></ol><h3>0.8.11</h3><ol><li>Buffer output in showYesNoQuestion()</li><li>Clean up CSS for lesson button</li></ol><h3>0.8.10</h3><ol><li>Add support for Yes/No check box responses to assignments</li><li>Add support for survey ranking field responses to assignments</li><li>Use E20R_VERSION constant to version JavaScript and CSS files</li><li>Didn't add new assignments in the correct order in all situations</li><li>Didn't always save article settings</li><li>Didn't always save assignment settings</li><li>Force page reload if the article is newly created and an assignment is being added</li></ol><h3>0.8.8</h3><ol><li>Prevent the daily assignment short code from bleeding into the actual post/page.</li><li>Only list assignments with a delay value == release_day for the article.</li></ol><h3>0.8.7</h3><ol><li>Wouldn't save assignment settings.</li><li>Didn't always set the correct assignment ID</li></ol><h3>0.8.6</h3><ol><li>Set correct timestamp value in short code</li><li>Didn't always load the user's previously saved data when loading workout definition.</li><li>Make sure user is logged in before accepting AJAX save of workout data.</li><li>Simplified userCanEdit()</li></ol><h3>0.8.5</h3><ol><li>Height of the date navigator in the &#91;daily_progress shortcode&#93; output</li><li>Layout of program definition settings in wp-admin</li><li>Set default $users setting for program on load</li><li>Fix: Make definition of page containing &#91;e20r_activity&#93; short code more robust for a program</li><li>Didn't always load an appropriate length excerpt</li><li>Didn't always select the url to the page containing the defined activity</li><li>Didn't always add a 'Click to read' link</li><li>Fix: Didn't load check-ins from article definition in getCheckins()</li><li>Add debug for getActions()</li><li>Fix: Loading of check-ins, actions &amp; activity display.</li><li>Add config setting for a program activity_page_id<li></ol><h3>0.8.4</h3><ol><li>Didn't always add a new default assignment for the article.</li><li>Didn't always load the correct status for the assignment.</li></ol><h3>0.8.3</h3><ol><li>Fix numerous issues when listing &#93;daily_progress type='assignment'&#91; output</li><li>0.8.2 - Fix program data load and add highlight around lesson complete button in daily assignment.</li><li>0.8.1 - Correctly handle next weeks activity archive.</li></ol><h3>0.8.0</h3><ol><li>Add &#91;20r_activity_archive&#93; short code support</li></ol><h3>0.7.1</h3><ol><li>Bumped to test auto-update</li></ol><h3>0.7.0</h3><ol><li>Added automatic update functionality</li></ol>"
  }
}

